# ============= 4 =============

xy = input('Введите координаты: ')
xy1 = input('Введите координаты: ')

if (((ord(xy[0]) + int(xy[1])) % 2 == 0) and ((ord(xy1[0]) + int(xy1[1])) % 2 == 0)):
    print('да')
elif (((ord(xy[0]) + int(xy[1])) % 2 != 0) and ((ord(xy1[0]) + int(xy1[1])) % 2 != 0)):
    print('да')
else: 
    print('нет')



# Ввод:
    # Введите координаты: a2
    # Введите координаты: d3

# Вывод:

    # да

# Ввод:
    # Введите координаты: a1
    # Введите координаты: a2

# Вывод:

    # нет