# ============= 6 =============

xy = input('Введите координаты: ')
xy1 = input('Введите координаты: ')

if 'a' <= xy[0] <= 'h' and 1 <= int(xy[1]) <= 8:
    
    if 'a' <= xy1[0] <= 'h' and 1 <= int(xy1[1]) <= 8:
    
        if -1 <= (ord(xy[0]) - ord(xy1[0])) <= 1 and -1 <= (int(xy[1]) - int(xy1[1])) <= 1:
            print('Да')
        else: 
            print('Нет')
    else:
        print('неверные координаты')

else:
    print('неверные координаты')




# Ввод:
    # Введите координаты: a1
    # Введите координаты: b2

# Вывод:

    # да

# Ввод:
    # Введите координаты: a1
    # Введите координаты: b3

# Вывод:

    # нет

# Ввод:
    #Введите координаты: a1
    #Введите координаты: n9
# Вывод:
    # неверные координаты