# ============= 6 =============

xy = list(input('Введите координаты: '))
xy1 = list(input('Введите координаты: '))

# if xy[0] == xy1[0] and -1 <= int(xy[1]) - int(xy1[1]) <= 1:
#     print('Да')
if xy[0] == 'a': 
    xy[0] = 1
if xy[0] == 'b': 
    xy[0] = 2
if xy[0] == 'c': 
    xy[0] = 3
if xy[0] == 'd': 
    xy[0] = 4
if xy[0] == 'e': 
    xy[0] = 5
if xy[0] == 'f': 
    xy[0] = 6
if xy[0] == 'g': 
    xy[0] = 7
if xy[0] == 'h': 
    xy[0] = 8

if xy1[0] == 'a': 
    xy1[0] = 1
if xy1[0] == 'b': 
    xy1[0] = 2
if xy1[0] == 'c': 
    xy1[0] = 3
if xy1[0] == 'd': 
    xy1[0] = 4
if xy1[0] == 'e': 
    xy1[0] = 5
if xy1[0] == 'f': 
    xy1[0] = 6
if xy1[0] == 'g': 
    xy1[0] = 7
if xy1[0] == 'h': 
    xy1[0] = 8

if -1 <= (xy[0] - xy1[0]) <= 1 and -1 <= (int(xy[1]) - int(xy1[1])) <= 1:
    print('Да')
else: 
    print('Нет')


# Ввод:
    # Введите координаты: a1
    # Введите координаты: b2

# Вывод:

    # да

# Ввод:
    # Введите координаты: a1
    # Введите координаты: b3

# Вывод:

    # нет